Revit 2026 API

# IFCExtrusionCreationData Class

---

A utility object that is used to pass information related to extrusion creation.

SystemObject Autodesk.Revit.DB.IFCIFCExtrusionCreationData

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCExtrusionCreationData : IDisposable
```
```vb
Public Class IFCExtrusionCreationData
	Implements IDisposable
```
```cpp
public ref class IFCExtrusionCreationData : IDisposable
```
```fsharp
type IFCExtrusionCreationData =
    class
        interface IDisposable
    end
```

The IFCExtrusionCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCExtrusionCreationData | The default constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | AllowVerticalOffsetOfBReps | Allows vertical shifting of breps when moving towards the origin. |
|  | AreInnerRegionsOpenings | True if inner regions of the extrusion should become openings, false otherwise. |
|  | CustomAxis | The custom extrusion axis to try when generating an extrusion. |
|  | ExtrusionDirection | The extrusion direction to generate an extrusion. |
|  | ForceOffset | True to create new local placement with identity transform. |
|  | HasCustomAxis | Identifies if the data contains a custom extrusion axis. |
|  | HasExtrusionDirection | Identifies if the data contains a extrusion direction. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PossibleExtrusionAxes | The axes to try when generating the properties of the extrusion. |
|  | ReuseLocalPlacement | Allows re-use of local placement when creating a new local placement due to shifting of breps when moving towards the origin. |
|  | ScaledArea | The area of the extrusion, scaled to the units of export. |
|  | ScaledHeight | The height of the extrusion, scaled to the units of export. |
|  | ScaledInnerPerimeter | The inner perimeter of the extrusion, scaled to the units of export. |
|  | ScaledLength | The length of the extrusion, scaled to the units of export. |
|  | ScaledOuterPerimeter | The outer perimeter of the extrusion, scaled to the units of export. |
|  | ScaledWidth | The width of the extrusion, scaled to the units of export. |
|  | Slope | The slope of the extrusion, in degrees. |

|  | Name | Description |
| --- | --- | --- |
|  | AddOpening | Adds an opening to the data. |
|  | ClearOpenings | Removes all cached openings from the data. |
|  | Dispose | Releases all resources used by the IFCExtrusionCreationData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLocalPlacement | Gets the reference to the IfcLocalPlacement handle used when creating the extrusion. |
|  | GetOpenings | Gets a collection of all of the openings stored in this data. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetLocalPlacement | Sets the data to reference an IfcLocalPlacement handle when creating the extrusion. Side effect: will set ReuseLocalPlacement to true. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class accepts input used to attempt to create an extrusion (possibly with openings) from Revit geometry. The output contains information about the created extrusion and its openings. The information set is used to generate properties for the extruded body and related opening elements in the IFC file.

#### Reference

Autodesk.Revit.DB.IFC Namespace